Tekla Open API Reference for Tekla Structures 2025
Profile Properties
The Profile type exposes the following members.
Properties
Name | Description
ProfileString
 The profile in human-readable form.
Top
See Also
Reference
Profile Class
Tekla.Structures.Model Namespace